Revit 2026 API

# RibbonPanelGetItems Method

---

Gets a copy of the collection of RibbonItems assigned to the RibbonPanel.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<RibbonItem> GetItems()
```
```vb
Public Function GetItems As IList(Of RibbonItem)
```
```cpp
public:
IList<RibbonItem^>^ GetItems()
```
```fsharp
member GetItems : unit -> IList<RibbonItem>
```

#### Return Value

IListRibbonItem

This method gets the items assigned to the RibbonPanel.

#### Reference

RibbonPanel Class

Autodesk.Revit.UI Namespace